import { observer } from "mobx-react-lite";
import { FC } from "react";
import useTelegram from "../../hooks/useTelegram";


const Home: FC = observer(() => {

  const names = [
    "Александра", "Алексей", "Анна", "Антон", "Артем", "Валерия", "Василий", "Виктория", "Владислав", "Владлен",
    "Дарья", "Дмитрий", "Екатерина", "Егор", "Елизавета", "Иван", "Игорь", "Ирина", "Кирилл", "Кристина",
    "Максим", "Мария", "Марина", "Михаил", "Наталья", "Николай", "Оксана", "Ольга", "Павел", "Петр",
    "Роман", "Светлана", "Сергей", "София", "Татьяна", "Тимофей", "Юлия", "Яна", "Андрей", "Евгения",
    "Алина", "Борис", "Вера", "Галина", "Денис", "Елена", "Захар", "Инна", "Карина", "Леонид",
    "Милана", "Никита", "Олеся", "Полина", "Руслан", "Снежана", "Тимур", "Ульяна", "Федор", "Ярослав",
    "Валентина", "Владимир", "Даниил", "Ефим", "Илья", "Катерина", "Константин", "Лилия", "Маргарита", "Нина",
    "Александр", "Анастасия", "Вадим", "Виктор", "Давид", "Евгений", "Григорий", "Георгий", "Ефросинья", "Иван",
    "Игорь", "Кира", "Лариса", "Людмила", "Марина", "Марк", "Надежда", "Олег", "Пётр", "Ринат",
    "Степан", "Станислав", "Тамара", "Устинья", "Фёдор", "Юрий", "Яков", "Алла", "Анжела", "Валентина",
    "Вероника", "Габриэль", "Данила", "Егор", "Жанна", "Злата", "Игорь", "Камилла", "Лада", "Матвей",
    "Наталия", "Олег", "Павел", "Раиса", "Софья", "Тимофей", "Ульяна", "Филипп", "Ярослав", "Артём",
    "Екатерина", "Илья", "Кирилл", "Любовь", "Матвей", "Наталья", "Николай", "Ольга", "Роман", "Сергей",
    "Татьяна", "Василий", "Виктория", "Даниил", "Елизавета", "Иван", "Ирина", "Ксения", "Максим", "Марина",
    "Мария", "Михаил", "Наталья", "Олег", "Павел", "Петр", "Ринат", "Сергей", "София", "Татьяна",
    "Андрей", "Анастасия", "Валентина", "Владимир", "Виктор", "Давид", "Дмитрий", "Елена", "Евгения", "Захар",
    "Инна", "Карина", "Ксения", "Лилия", "Любовь", "Маргарита", "Михаил", "Никита", "Оксана", "Ольга",
    "Полина", "Роман", "Светлана", "Сергей", "София", "Станислав", "Татьяна", "Тимофей", "Ульяна", "Федор"
  ];

  // const tg = useTelegram()

  // if(tg) {
  //   const text = JSON.stringify(tg)
  //   return <p>{text}</p>
  // }
  return (
    <>
      {names.map((name) => (
        <h4>{name}</h4>
      ))}
    </>
  )
  
  
})

export default Home;
